//=================================================================================================  
//================================================================================================= 
//
//                                    S . P O R T   C L A S S
//
//================================================================================================= 
//=================================================================================================

//    forward declaration of main and utility functions

uint32_t  Abs(int32_t);
float     RadToDeg (float );
uint16_t  prep_number(int32_t, uint8_t, uint8_t);
uint32_t  bit32Extract(uint32_t,uint8_t, uint8_t); 
void      bit32Pack(uint32_t, uint8_t, uint8_t);
uint32_t  createMask(uint8_t, uint8_t);
int16_t   Add360(int16_t, int16_t);
float     wrap_360(int16_t);
int8_t    PWM_To_63(uint16_t);
void      nbdelay(uint32_t);
void      DisplayPrintln(String);
void      PrintByte(byte, bool);
void      PrintByteNon(byte);
void      PrintByteOut(byte);
void      PrintByteIn(byte);
void      PrintMavLiteUplink();
void      PrintFrPeriod(bool);
void      PrintFrPeriod(bool);
uint8_t   PX4FlightModeNum(uint8_t, uint8_t);
void      Mavlink_Param_Request_Read(int16_t, char *);
void      Mavlink_Param_Set();
void      Mavlink_Command_Long();
void      SP_Byte_To_SD(byte);

class     SPort 
{ 
    // Data members 
  public: 
    
  private:
  
    bool      printcrc = false;
    byte      nb, lb;                      // NextByt, LastByt of ByteStuff pair     
    int16_t   CRC;                         // CRC of frsky frame
    uint8_t   time_slot_max = 16;              
    uint32_t  time_slot = 1;
    float     a, az, c, dis, dLat, dLon;
    uint8_t   sv_count = 0;

    volatile uint8_t *uartC3;
    enum SPortMode { rx , tx };
    SPortMode mode, modeNow;
  
    static const uint16_t  sp_max = 32;           // low level s.port read buffer
    byte            sp_buff[sp_max];
    uint16_t        sp_idx = 0;



    //                      S  C  H  E  D  U  L  E  R

    // Give the S.Port table more space when status_text messages sent three times
    #if defined Send_status_Text_3_Times
      static const uint16_t sb_rows = 300;  // possible unsent sensor ids at any moment 
    #else 
     static const uint16_t sb_rows = 130;  
    #endif 
    uint16_t        sb_row = 0;
  
    typedef union {
    struct {
       uint32_t       passthru;       // 4B  passthru payload
       uint16_t       packing;        // 2B   
         };
       mtf_payload_t  mavlite;        // 6B  mavlite payload
      }
      sb_payload_t;                          

    // Scheduler identity for both Mavlink and MavLite
    typedef struct  {
      uint16_t      msg_id;          // 2B - note Mavlink needs 2 byte msg_id
      uint8_t       sub_id;          // 1B
      uint32_t      millis;          // 4B - mS since boot
      uint8_t       mt_idx;          // 1B - index if it is a MavLite frame class
      uint8_t       inuse;           // 1B
      sb_payload_t  payload;         // 6B
    } sb_t;

    sb_t          sb[sb_rows];                    // Scheduler buffer table


    uint32_t        sb_buf_full_gear = 0;         // downlink
    uint32_t        mt_buf_full_gear = 0;        // downlink
    uint32_t        mt20_buf_full_gear = 0;      // uplink

    uint32_t        sr_pt_payload;                // 4B
    uint16_t        sb_unsent;                    // how many sb rows in use  
    uint16_t        mt_unsent;                    // how many mt rows in use  


    // Member function declarations
  public:    
    void          initialise();
    void          SendAndReceive(); 
    void          PushMessage(uint16_t msg_id, uint8_t sub_id);  
    void          ReportSPortOnlineStatus(); 
    uint16_t      MatchWaitingParamRequests(char * paramid);           
  private:   
    void          setMode(SPortMode mode);
    void          AddInCrc(uint8_t b);   
    byte          SafeRead();
    void          StuffAndSend(byte b, bool isPayload);
    void          SendByte(byte b);    
    void          BlindInject(); 
    void          InjectFrame();  
    uint16_t      PopNextFrame();  
    msg_class_t   msg_class_now(uint8_t msg_id);
    void          Send_SPort_Frame(uint16_t idx);
    bool          DecodeAndUplinkMavLite();  
