//=================================================================================================  
//================================================================================================= 
//
//                                    F . P O R T   C L A S S
//
//================================================================================================= 
//=================================================================================================


#if defined frBuiltin   // FrSky port support

   #define fpStatusLed    99        // not used in this application
   #define InvertfpLed    false

  //    forward declaration of main and utility functions

  uint32_t  Abs(int32_t);
  float     RadToDeg(float );
  uint32_t  TenToPwr(uint8_t pwr);  
  uint16_t  prep_number(int32_t, uint8_t, uint8_t);
  uint32_t  bit32Extract(uint32_t,uint8_t, uint8_t); 
  void      bit32Pack(uint32_t, uint8_t, uint8_t);
  uint32_t  createMask(uint8_t, uint8_t);
  int16_t   Add360(int16_t, int16_t);
  float     wrap_360(int16_t);
  int8_t    PWM_To_63(uint16_t);
  int8_t    THR_To_63(uint16_t);
  void      nbdelay(uint32_t);
  void      LogScreenPrintln(String);
  void      Printbyte(byte, bool, char);
  void      PrintMavLiteUplink();
  void      PrintFrPeriod(bool);
  void      PrintLoopPeriod();
  uint8_t   PX4FlightModeNum(uint8_t, uint8_t);
  void      Mavlink_Param_Request_Read(int16_t, char *);
  void      Mavlink_Param_Set();
  void      Send_Mavlink_Command_Long();
  void      SP_Byte_To_SD(byte);
  String    MavSeverity(uint8_t);

  class     FrSkyPort 
  { 
    // Data members 
  public: 

  private:
  
    frport_t  frport_id = f_none;  
    
    static const uint8_t timeout_secs = 5;
    
    byte      chr = 0;
    byte      prev_chr = 0;    
    bool      fpInit = false; 
    bool      serGood = false;
    bool      frGood = false;
    bool      frPrev = false; 
    bool      pwmGood = false; 
    bool      pwmPrev = false;
    uint32_t  frGood_millis = 0;   
    uint32_t  serGood_millis = 0;  
    uint32_t  pwmGood_millis = 0;       

    bool      parseGood = false;
    uint32_t  goodFrames = 0;
    uint32_t  badFrames = 0;
    uint32_t  packetloss_millis = 0;
    uint8_t   fpLedState = LOW; 
    uint32_t  fpLed_millis = 0;
             
    #define   frameSize  38                   // len, type, 35(24ch control) + CRC = 38
    byte      fpbuf[frameSize];

    static const uint8_t max_ch = 26;         // 24 + 2 digi ch
    int16_t   pwm_ch[max_ch];                 // PWM Channels
    uint8_t   pwm_rssi = 0;
  
    int16_t   crcin = 0;                      // CRC of inbound frsky frame   
    int16_t   crcout = 0;   
    uint16_t  lth = 0;

    uint8_t   fr_lth = 0;
    uint8_t   fr_type = 0;
    uint8_t   fr_prime = 0;
    
    volatile uint8_t *uartC3;
    
    enum PortMode { rx , tx };
    PortMode mode, modeNow;

    bool      printcrcout = false;
    byte      nb, lb;                      // Nextbyte, Lastbyt of ByteStuff pair     
  
    uint8_t   time_slot_max = 16;              
    uint32_t  time_slot = 1;
    float     a, az, c, dis, dLat, dLon;
    uint8_t   sv_count = 0;

    uint8_t   prevbyt=0;

    bool      frInvert = false;
    uint32_t  frBaud = 0; 
    uint16_t  fr_idx = 0;
    uint8_t   p_fr = 0;   
    
    static const uint16_t  fr_max = 48;           // frport frame buffer  35 + 2 + headroom 
    byte      frbuf[fr_max];

    bool ftgetBaud = true;
    
    //=================================================================================
    //                      S  C  H  E  D  U  L  E  R

    // Give the F.Port table more space when status_text messages sent three times
    #if defined Send_status_Text_3_Times
      static const uint16_t sb_rows = 256;  // possible unsent sensor ids at any moment 
    #else 
     static const uint16_t sb_rows = 128;  
    #endif 
    uint16_t        sb_row = 0;
  
    typedef union {
    struct {
       uint32_t       passthru;       // 4B  passthru payload
       uint16_t       packing;        // 2B   
         };
       mtf_payload_t  mavlite;        // 6B  mavlite payload
      }
      sb_payload_t;                          

    // Scheduler identity for both Mavlink and MavLite
    typedef struct  {
      uint16_t      msg_id;          // 2B - note Mavlink needs 2 byte msg_id
      uint8_t       sub_id;          // 1B
      uint32_t      millis;          // 4B - mS since boot
      uint8_t       mt_idx;          // 1B - index if it is a MavLite frame class
      uint8_t       inuse;           // 1B
      sb_payload_t  payload;         // 6B
    } sb_t;
    
    sb_t          sb[sb_rows];                    // Scheduler buffer table


    uint32_t        sb_buf_full_gear = 0;        // downlink
    uint32_t        mt_buf_full_gear = 0;        // downlink
    uint32_t        mt20_buf_full_gear = 0;      // uplink

    uint32_t        sr_pt_payload;                // 4B
    uint16_t        sb_unsent;                    // how many sb rows in use  
    uint16_t        mt_unsent;                    // how many mt rows in use  

    // Member function prototypes
  public:  
    void          initialise();   
    void          HandleTraffic();
    void          PushMessage(uint16_t msg_id, uint8_t sub_id); 
    void          ReportFrPortOnlineStatus();      
    uint16_t      MatchWaitingParamRequests(char * paramid); 
    uint32_t      getBaud(uint8_t rxpin, pol_t pl);       
             
  private:  
    void          set_gpio_in_inv( uint8_t pin_num );  // set_gpio polarity for RP2040 only
    void          set_gpio_in_ninv( uint8_t pin_num );  
    void          set_gpio_out_inv( uint8_t pin_num );
    void          set_gpio_out_ninv( uint8_t pin_num );
    void          set_gpio_inout_pol( uint8_t pin_num, uint8_t in_out, uint8_t pol);
  
    pol_t         getPolarity(uint8_t pin);
